{
  "profile": {
    "name": "Yanuar Tri Laksono",
    "title": "Android Developer & Software Engineer",
    "description": "Android Developer & Software Engineer with 5 years of experience building innovative mobile applications using Flutter, Kotlin, and Java",
    "location": "Nganjuk, Jawa Timur",
    "education": "Politeknik Negeri Jember",
    "email": "yanuartrilaksono23@gmail.com",
    "phone": "+62 857-3357-1682",
    "profileImage": "/Me.png",
    "socialLinks": {
      "github": "https://github.com/yanuartrilaksono",
      "linkedin": "https://linkedin.com/in/yanuar-tri-laksono",
      "portfolio": "https://yanuar.dev"
    }
  },
  "about": {
    "description": [
      "As a software developer with 5 years of experience in building both native and hybrid mobile applications, I am passionate about creating innovative and user-focused digital solutions.",
      "I specialize in Android development, with hands-on experience using Flutter, Java, Kotlin, and backend technologies such as Firebase and Laravel. I'm also exploring the exciting world of Generative AI, applying it in real-world mobile applications to enhance interactivity and automation.",
      "My portfolio includes a wide range of projects, from Bookread AI (a Flutter-based AI storytelling app) to fully automated short video generation tools using AI and text-to-speech technologies."
    ],
    "skills": [
      {
        "category": "Mobile Development",
        "items": [
          "Flutter",
          "Android (Kotlin/Java)",
          "iOS (Swift)",
          "React Native"
        ]
      },
      {
        "category": "Backend & Database",
        "items": [
          "Firebase",
          "Laravel",
          "MySQL",
          "PostgreSQL"
        ]
      },
      {
        "category": "Programming Languages",
        "items": [
          "Dart",
          "Kotlin",
          "Java",
          "Swift",
          "PHP",
          "JavaScript"
        ]
      },
      {
        "category": "AI & Modern Tech",
        "items": [
          "Generative AI",
          "OpenAI API",
          "Text-to-Speech",
          "Machine Learning"
        ]
      }
    ],
    "education": {
      "degree": "Diploma 4 Teknik Informatika",
      "institution": "Politeknik Negeri Jember",
      "period": "2021 - Present",
      "gpa": "3.83/4.0",
      "coursework": "Logic and Algorithms, Human-Computer Interaction, Mobile Application Programming with Frameworks"
    }
  },
  "experience": [
    {
      "company": "Studyo.io",
      "position": "Android Developer Full Time",
      "location": "Remote, Surabaya, Indonesia",
      "period": "Jan 2023 – Mar 2023",
      "type": "Full-time Remote",
      "responsibilities": [
        "Developing cross-platform mobile applications for Android and iOS using Flutter",
        "Building the Bookread AI application, a story creation platform powered by Generative AI",
        "Integrating Firebase Firestore, Authentication, and Cloud Storage to enhance app performance and scalability",
        "Handling the deployment process to both Google Play Store and Apple App Store",
        "Creating and maintaining internal libraries to improve code reuse and streamline development across projects",
        "Developed an Easy Custom Animation library to help the team implement consistent, reusable animations efficiently",
        "Supporting team collaboration by managing tasks, conducting code reviews, and ensuring clean, maintainable codebases",
        "Assisting in the development of an educational math game application for elementary school students, focusing on engaging, gamified learning experiences"
      ],
      "technologies": [
        "Flutter",
        "Dart",
        "Firebase",
        "Android",
        "iOS",
        "AI Integration",
        "Cloud Storage",
        "Animation"
      ]
    },
    {
      "company": "Ngawi",
      "position": "Omaigad",
      "location": "Florida",
      "period": "2026-2039",
      "type": "Full Time",
      "responsibilities": [
        "Developing cross-platform mobile applications for Android and iOS using Flutter",
        "Building the Bookread AI application, a story creation platform powered by Generative AI"
      ],
      "technologies": [
        "Flutter"
      ]
    },
    {
      "company": "Ontario Tec",
      "position": "Lead",
      "location": "Cannada",
      "period": "2024",
      "type": "Full Time",
      "responsibilities": [
        "NGawi"
      ],
      "technologies": [
        "Flutter"
      ]
    },
    {
      "company": "Apple Developer Academy @ UC",
      "position": "iOS Developer",
      "location": "Surabaya, East Java, Indonesia",
      "period": "Apr 2025 - May 2025",
      "type": "Internship",
      "responsibilities": [
        "Transforming UI/UX designs into functional views using SwiftUI",
        "Setting up the initial project architecture and developing core components for a Student Inventory Management application",
        "Implementing full CRUD functionality for inventory data",
        "Assisting team members by debugging issues and providing technical support during development",
        "Configuring app permissions using the Info.plist file",
        "Performing real device testing to ensure smooth performance on iOS hardware",
        "Collaborating within a cross-functional team and contributing to agile development cycles"
      ],
      "technologies": [
        "SwiftUI",
        "iOS Development",
        "Info.plist",
        "CRUD operations",
        "Agile Development"
      ]
    }
  ],
  "projects": [
    {
      "title": "Al-Quran-Ku Flutter Mobile",
      "description": "Al-Quran-Ku is a user-friendly mobile application designed to facilitate an immersive Quran reading experience.",
      "longDescription": "Al-Quran-Ku is a user-friendly mobile application developed using Flutter, designed to facilitate an immersive Quran reading experience. The app features the complete Quran text, offering users the ability to read at their own pace. A notable aspect of Al-Quran-Ku is its selection of four esteemed Qaris, allowing users to choose their preferred reciter for a more personalized experience. Additionally, the app provides comprehensive translations of verses, coupled with transliterations in Latin script, catering to a wide range of users regardless of their Arabic proficiency. With its intuitive design and comprehensive features, Al-Quran-Ku is an ideal companion for anyone seeking to engage with the Quran's teachings.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750393733867-4rssppqm5d.png"
      ],
      "features": [
        "Full access to all 114 surahs",
        "Details on place of revelation & number of verses",
        "Save and resume your last reading",
        "Choose your favorite Qari for beautiful recitations",
        "Complete translation & tafsir",
        "Minimalist, eye-friendly design",
        "Offline listening feature — no internet required"
      ],
      "technologies": [
        "Flutter",
        "Android",
        "iOS"
      ],
      "status": "Open Source",
      "github": "https://github.com/Greek-Cp",
      "demo": "#"
    },
    {
      "title": "Spkaiy App Mobile Flutter",
      "description": "Spkaiy is an application tailored to empower the Cambodian community by facilitating their entry into the marketplace.",
      "longDescription": "My role in the development of Spkaiy involved implementing a QR code reading feature, enhancing the app's layout, integrating a store feature, and revamping the home screen to include various categories. These contributions have been pivotal in making Spkaiy a user-friendly platform for Cambodians to effectively advertise and sell their products. The application focuses on providing a seamless experience for users, ensuring they can easily navigate through categories and utilize the store feature. The QR code functionality adds a modern touch, allowing for quick access to information and products.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750348240390-nhhbj6wyfv.png"
      ],
      "features": [
        "Implemented QR code reading feature",
        "Improved app layout for enhanced user experience",
        "Implemented store feature within the app",
        "Enhanced home screen appearance by adding various categories"
      ],
      "technologies": [
        "Flutter",
        "Responsive Design",
        "Mobile Development"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp",
      "demo": "https://github.com/Greek-Cp"
    },
    {
      "title": "Books Reads AI Flutter Mobile",
      "description": "An innovative application crafted for story enthusiasts and creators, blending storytelling and technology.",
      "longDescription": "Books Reads AI Flutter Mobile is an innovative application crafted for story enthusiasts and creators. Developed using Flutter, it offers a unique blend of storytelling and technology. Users can write their own stories and, leveraging the power of AI, the app automatically generates accompanying images, bringing narratives to life visually. This app is perfect for those who wish to see their imagination vividly illustrated, making it a groundbreaking tool in digital storytelling. The project includes the implementation of responsive design to ensure adaptability across various devices, alongside the application of Clean Architecture principles for efficient coding. By integrating Vertex AI and Open AI APIs, the app provides a seamless story generation experience, enhancing user engagement and creativity.",
      "icon": "Smartphone",
      "color": "from-green-400 to-emerald-400",
      "images": [
        "/uploads/1750348384658-sf5jw5sxo4o.png"
      ],
      "features": [
        "User story writing",
        "AI-generated images",
        "Responsive design"
      ],
      "technologies": [
        "Flutter",
        "Vertex AI",
        "Open AI API"
      ],
      "status": "Completed",
      "github": "https://bookrea.com/",
      "demo": "https://play.google.com/store/apps/details?id=com.bookrea.story"
    },
    {
      "title": "Studyo Tutors Apps Flutter Mobile",
      "description": "Studyo Tutors Apps is an innovative learning platform that combines the engaging format of TikTok with educational content.",
      "longDescription": "This app is designed to make learning interactive and fun, focusing on short-form video tutorials that cater to a wide range of educational topics. Its intuitive interface, inspired by popular social media formats, makes it easy for users to navigate and absorb information effectively. Studyo Tutors is ideal for learners who seek a modern, dynamic approach to education, blending entertainment with knowledge.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750348565232-0hco6pfnb3o.png"
      ],
      "features": [
        "Short-form video tutorials",
        "Interactive learning experience",
        "User-friendly interface"
      ],
      "technologies": [
        "Flutter",
        "Firebase Firestore",
        "Cloud Storage",
        "API Integration"
      ],
      "status": "In Development",
      "github": "#",
      "demo": "#"
    },
    {
      "title": "Dating App Mobile Flutter",
      "description": "Dating Mobile is a custom-built application designed to showcase proficiency in Flutter development.",
      "longDescription": "This app offers a platform for users to connect, explore, and engage with potential matches. With a clean and user-friendly interface, it simplifies the process of finding and interacting with new people. The app incorporates essential dating app features such as profile creation, search filters, and secure messaging, all while showcasing the capability to create a fully functional, robust application using Flutter. Dating Mobile stands as both a practical dating tool and a personal milestone in the Flutter development journey.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750348683787-kgqnsw7h5an.png"
      ],
      "features": [
        "Profile creation",
        "Search filters",
        "Secure messaging"
      ],
      "technologies": [
        "Flutter",
        "Dart",
        "Clean Architecture"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp/dating_app",
      "demo": "https://github.com/Greek-Cp/dating_app"
    },
    {
      "title": "E-Parent Control Mobile Native",
      "description": "E-Parenting Control is a comprehensive application designed for parents to monitor and manage their children's digital activities.",
      "longDescription": "E-Parenting Control provides real-time insights into app usage, internet browsing, and social media interaction, ensuring children's online experiences are safe and age-appropriate. The app includes features for setting screen time limits, blocking unsuitable content, and tracking location for safety. E-Parenting Control is an essential tool for modern parents who want to balance the benefits of digital access with the importance of maintaining a safe and healthy online environment for their children. The application design has been implemented with a focus on user experience and functionality, making it easy for parents to navigate and utilize its features effectively.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750348835553-a86eahllq88.png"
      ],
      "features": [
        "Real-time insights into app usage",
        "Setting screen time limits",
        "Blocking unsuitable content",
        "Tracking location for safety"
      ],
      "technologies": [
        "Java",
        "Retrofit",
        "View Binding",
        "Clean Architecture"
      ],
      "status": "Completed",
      "github": "#",
      "demo": "#"
    },
    {
      "title": "E-RT Mobile Native",
      "description": "E-RT Mobile Apps is a versatile application designed to streamline administrative tasks for local community leaders.",
      "longDescription": "E-RT Mobile Apps simplifies the management of correspondence, keeping everything organised and accessible. Additionally, residents within the community can stay updated on local events and activities. The app also includes a feature for reporting incidents, ensuring a quick response to community issues. Moreover, it offers a transparent view of the community's finances, allowing for efficient monitoring of cash flow. This app is an essential tool for enhancing community engagement and management.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750348949445-c53j244lpt.png"
      ],
      "features": [
        "Streamlined management of correspondence",
        "Updates on local events and activities",
        "Incident reporting feature",
        "Transparent view of community finances"
      ],
      "technologies": [
        "Kotlin",
        "Retrofit",
        "Data Binding",
        "Clean Architecture"
      ],
      "status": "Completed",
      "github": "#",
      "demo": "#"
    },
    {
      "title": "Sidokare Apps Flutter Mobile",
      "description": "Desa SidoKare app is a tailored solution designed to streamline the operations and services of the village employees in SidoKare.",
      "longDescription": "This application simplifies various administrative tasks, enhancing the efficiency of service delivery to the community. Additionally, it serves as a vital tool for residents, providing them with the ability to easily access and monitor local news and updates. By bridging the gap between village officials and the community, the Desa SidoKare app plays a crucial role in fostering transparent and effective communication, thus improving the overall quality of village governance and resident engagement.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750349039045-egqb9ec6lve.png"
      ],
      "features": [
        "Streamlined operations for village employees",
        "Access to local news and updates for residents",
        "Enhanced service delivery efficiency"
      ],
      "technologies": [
        "Flutter",
        "Laravel API",
        "Clean Architecture"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp/sidokare_mobile_app",
      "demo": "https://github.com/Greek-Cp/sidokare_mobile_app"
    },
    {
      "title": "BARITA Mobile Native",
      "description": "Bacarita is an application for reading news equipped with a news bookmark feature.",
      "longDescription": "Bacarita is an application designed for reading news that allows users to bookmark articles for later reading. Users can also track the number of news articles they have read and share them on various platforms such as WhatsApp and Facebook. This application was developed as a coding submission to showcase my skills in Android development. The application is built using Kotlin and follows clean architecture principles for better organization and maintainability of the codebase.\n\nThe app integrates a REST API using Retrofit, which allows for seamless data fetching and management. To simplify UI management, View Binding has been employed, providing a more efficient way to interact with views in the application. The design is responsive, ensuring an optimal user experience across a variety of devices, making it accessible to a wider audience.\n\nOverall, the project highlights my ability to develop a feature-rich mobile application while adhering to best practices in software development. The focus on clean architecture and responsive design reflects a commitment to delivering high-quality software that meets user needs and expectations.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750349172457-f2l9flms4g.png"
      ],
      "features": [
        "News bookmark feature",
        "Track number of news read",
        "Share news on social media"
      ],
      "technologies": [
        "Kotlin",
        "Retrofit",
        "View Binding"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp/BaritaBacaBerita2",
      "demo": "https://github.com/Greek-Cp/BaritaBacaBerita2"
    },
    {
      "title": "AG-FOOD Mobile Native",
      "description": "AG-FOOD is a streamlined application designed to assist small and medium-sized food businesses (UMKM) in enhancing their sales.",
      "longDescription": "AG-FOOD is a mobile application that provides an easy-to-use platform for small and medium-sized food businesses to showcase and sell their food products. The application not only facilitates sales for these businesses but also offers customers a convenient online ordering system. Users can effortlessly browse and purchase their desired food items, bridging the gap between local food vendors and their customers.\n\nThe application has been designed with a focus on user experience, ensuring that both vendors and customers can navigate the platform with ease. AG-FOOD integrates a REST API using Retrofit in Java, allowing for seamless data handling and communication between the application and the backend services. This integration is crucial for real-time updates on product availability and order status.\n\nIn terms of development practices, Clean Architecture has been applied to maintain a structured and maintainable codebase. This approach allows for easier testing and future enhancements, which is vital for the application's longevity. Additionally, using View Binding has improved UI management, making it more efficient and reducing the likelihood of errors in layout handling.\n\nThe responsive design ensures optimal user experience across various devices, catering to a wide audience. Overall, AG-FOOD stands as a significant tool for enhancing the sales and visibility of small and medium-sized food businesses in the digital marketplace.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750349291944-8lo7822r37m.png"
      ],
      "features": [
        "Easy-to-use platform for food businesses",
        "Convenient online ordering system for customers",
        "Seamless online transactions between vendors and customers"
      ],
      "technologies": [
        "Java",
        "Retrofit",
        "View Binding",
        "Clean Architecture"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp/Ag_food",
      "demo": "https://github.com/Greek-Cp/Ag_food"
    },
    {
      "title": "Al-Quranku",
      "description": "Quranku is a digital Qur’an app built with Flutter and dedicated to the Muslim Ummah.",
      "longDescription": "At the end of this blessed month of Ramadan, Alhamdulillah… I’m proud to present Quranku, a digital Qur’an app built with Flutter and dedicated to the Muslim Ummah. Quranku is designed to help Muslims stay connected with the Qur’an anytime, anywhere. This app offers a minimalist and eye-friendly design, making it easier for users to read and engage with the Qur'an. I hope this app brings benefit, and I truly welcome any feedback from you all!",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750393746863-kd0m21mkb9g.png"
      ],
      "features": [
        "Full access to all 114 surahs",
        "Details on place of revelation & number of verses",
        "Save and resume your last reading",
        "Choose your favorite Qari for beautiful recitations",
        "Complete translation & tafsir",
        "Minimalist, eye-friendly design",
        "Offline listening feature — no internet required"
      ],
      "technologies": [
        "Flutter"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp/Al-Quran-Ku-Flutter",
      "demo": "https://github.com/Greek-Cp/Al-Quran-Ku-Flutter"
    },
    {
      "title": "Health Wise",
      "description": "Cancer Detection Using a Cell Phone Camera.",
      "longDescription": "Health Wise is an application developed as part of the requirements for the 'Learning to Apply Machine Learning for Android' course from Dicoding Indonesia. The app utilizes Kotlin and a TensorFlow Lite model to detect cancer using a cell phone camera. This innovative approach enables users to perform preliminary cancer screenings conveniently and efficiently.\n\nThroughout the development process, I gained a comprehensive understanding of fundamental Machine Learning concepts, including the implementation of ML Kit, MediaPipe, and Firebase Machine Learning. This knowledge was crucial in building a robust application that leverages the latest technologies to provide accurate results.\n\nMoreover, I delved deeper into advanced Android development topics such as Room for local database management, Dependency Injection for improved code structure, Clean Architecture for maintainability, and DataStore for data persistence. These skills significantly enhanced my ability to create efficient and scalable applications.\n\nAdditionally, I explored the potential of Generative AI in application development, which has broadened my perspective on building intelligent applications. This project not only solidified my understanding of Android development and Machine Learning but also prepared me for future challenges in the tech industry.",
      "icon": "Smartphone",
      "color": "from-green-400 to-emerald-400",
      "images": [
        "/uploads/1750393145039-k1y4n9vab5d.png"
      ],
      "features": [
        "Cancer detection using cell phone camera",
        "User-friendly interface",
        "Data privacy and security"
      ],
      "technologies": [
        "Kotlin",
        "TensorFlow Lite",
        "ML Kit"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp/HealtWiseApp",
      "demo": "https://github.com/Greek-Cp/HealtWiseApp"
    },
    {
      "title": "Edu Guide",
      "description": "Edu Guide is an application that provides career or major recommendations based on the user's selected interests.",
      "longDescription": "Edu Guide is designed to assist students in making informed decisions about their future careers or areas of study. The application employs a forward chaining algorithm, allowing users to select a set of facts that, when ordered correctly, form a rule. This rule is then used by the system to generate personalized recommendations for suitable majors or career paths. By integrating user interests with algorithmic processing, Edu Guide aims to streamline the decision-making process for students.\n\nThe application offers a user-friendly interface developed in Flutter, ensuring a seamless experience on mobile devices. Through Firebase, the application provides secure authentication and real-time database services, allowing users to save their preferences and receive recommendations instantly. The backend logic, implemented in Python, handles the complexities of the forward chaining algorithm, ensuring that the recommendations are both relevant and accurate.\n\nAdditionally, web-based components are supported through JavaScript, enabling broader accessibility and integration capabilities. This multi-faceted approach not only enhances the functionality of the application but also allows for future expansions and feature enhancements. Edu Guide stands as a comprehensive tool for students looking to explore their academic and career options effectively.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750393435315-d7pphrwm0om.png"
      ],
      "features": [
        "Career recommendations based on user interests",
        "Forward chaining algorithm for personalized suggestions",
        "Real-time database services for instant updates"
      ],
      "technologies": [
        "Flutter",
        "Firebase",
        "Python",
        "JavaScript"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp/forward_chaining_man_app",
      "demo": "https://github.com/Greek-Cp/forward_chaining_man_app"
    },
    {
      "title": "QStory: Sharing Stories via Mobile Phone",
      "description": "An application developed for sharing stories via mobile phone as part of the Intermediate Android Application Development course.",
      "longDescription": "I am very happy to have achieved the latest certification: Intermediate Android Application Development from Dicoding Indonesia! As part of the requirements for graduating this class, I built an application, 'QStory: Sharing Stories via Mobile Phone'. I developed this app using Kotlin and various advanced features taught in the course. During my learning, I delved into concepts like Advanced UI, Animation, Localization & Accessibility, Services, Media, and Advanced Testing. I also implemented Geo Location features, Advanced Database, and Firebase integration in this application. This project is a graduation requirement of the 'Intermediate Android Application Development' course. During this process, I dug deeper into the importance of clean and efficient architecture, as well as good Dependency Injection techniques. The knowledge I gained not only strengthened my understanding of Android development, but also opened up my insight into how to build good and structured applications.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750393903926-b5p7kpwgi2c.png"
      ],
      "features": [
        "Advanced UI",
        "Animation",
        "Geo Location features",
        "Advanced Database",
        "Firebase integration"
      ],
      "technologies": [
        "Kotlin",
        "Firebase",
        "Android"
      ],
      "status": "Completed",
      "github": "https://github.com/Greek-Cp/QStory",
      "demo": "https://github.com/Greek-Cp/QStory"
    },
    {
      "title": "Pomotask",
      "description": "Pomotask is an app that integrates the Pomodoro technique with AI-powered task planning to help users stay focused.",
      "longDescription": "Pomotask is my latest portfolio project built with Flutter. This app integrates the Pomodoro technique with AI-powered task planning, helping users stay focused and manage their study or work sessions efficiently. Developed with Flutter, Pomotask delivers a smooth and responsive experience across devices.\n\nThe app features AI-powered task scheduling, allowing users to efficiently plan their tasks while maintaining productivity. With a Pomodoro timer for structured work sessions, users can optimize their time and stay engaged in their activities. Additionally, the app includes smart breaks to help users refresh and recharge, ensuring sustained productivity throughout their work sessions.\n\nPomotask is designed with a minimalist and intuitive interface, making it easy for users to navigate and utilize its features. As part of my portfolio, this project showcases my ability to build efficient, AI-driven, and user-friendly applications that cater to the needs of users looking to enhance their productivity. I am excited to share this project and would love to hear your thoughts!",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750394027317-wy34s1s70bl.png"
      ],
      "features": [
        "AI-powered task scheduling",
        "Pomodoro timer for structured work sessions",
        "Smart breaks to maintain productivity",
        "Minimalist & intuitive design"
      ],
      "technologies": [
        "Flutter"
      ],
      "status": "Completed",
      "github": "#",
      "demo": "#"
    },
    {
      "title": "Bibit Unggulan Nganjuk (BUN)",
      "description": "An innovative mobile application designed to simplify the certification and management of premium fruit plant seeds.",
      "longDescription": "BUN is a mobile application that focuses on the certification and management of premium fruit plant seeds. With features like QR code scanning and generation, it allows users to instantly access detailed information about each seed. The application streamlines the certification process, ensuring quality and authenticity in real-time. Users can also easily consult with the seed owners and place orders directly through the app.",
      "icon": "Smartphone",
      "color": "from-blue-400 to-cyan-400",
      "images": [
        "/uploads/1750394520958-2kjkm7l9m3l.png"
      ],
      "features": [
        "QR Code Scanning – Instantly access detailed information about each seed.",
        "QR Code Generation – Easily create QR codes with certification data and origin details.",
        "Automated Certification – Streamlines the seed certification process, ensuring quality and authenticity in real-time.",
        "Contact the Owner – Directly consult with and order seeds from the source.",
        "Share Information – Seamlessly share scan results via social media or messaging apps."
      ],
      "technologies": [
        "Flutter",
        "Firebase",
        "Firestore"
      ],
      "status": "Completed",
      "github": "#",
      "demo": "#"
    }
  ],
  "technologies": [
    {
      "name": "Kotlin",
      "icon": "Smartphone"
    },
    {
      "name": "Java",
      "icon": "Code2"
    },
    {
      "name": "Flutter/Dart",
      "icon": "Smartphone"
    },
    {
      "name": "React Native",
      "icon": "Code2"
    },
    {
      "name": "Firebase",
      "icon": "Database"
    },
    {
      "name": "Git",
      "icon": "GitBranch"
    }
  ]
}